2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_gpio.c
/**
*     Copyright (c) 2025, Nsing Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nsing Technologies Inc. (Hereinafter 
* referred to as Nsing). This software, and the product of Nsing described herein 
* (Hereinafter referred to as the Product) are owned by Nsing under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     Nsing does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     Nsing reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact Nsing and obtain 
* the latest version of this software before placing orders.

*     Although Nsing has attempted to provide accurate and reliable information, Nsing assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall Nsing be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     Nsing Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify Nsing and hold Nsing 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by Nsing, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     Nsing products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g033_gpio.c
*\*\author Nsing
*\*\version v1.0.0
*\*\copyright Copyright (c) 2025, Nsing Technologies Inc. All rights reserved.
**/
#include "n32g033_gpio.h"
#include "n32g033_rcc.h"

      
#define GPIO_MODE                       ((uint32_t)0x00000003)
#define EXTI_MODE                       ((uint32_t)0x10000000)
#define GPIO_MODE_IT                    ((uint32_t)0x00010000)
#define GPIO_MODE_EVT                   ((uint32_t)0x00020000)
#define RISING_EDGE                     ((uint32_t)0x00100000) 
#define FALLING_EDGE                    ((uint32_t)0x00200000)
#define GPIO_OUTPUT_TYPE                ((uint32_t)0x00000010)

/**
 *\*\name   GPIO_DeInit.
 *\*\fun    Reset the GPIOx peripheral registers to their default reset values.
 *\*\param  none
 *\*\return none
 */
void GPIO_DeInit(void)
{
    RCC_EnableAPBPeriphReset(RCC_APB_PERIPH_GPIO);
}

/**
 *\*\name   GPIO_DeInitPin.
 *\*\fun    Deinitializes the GPIOx peripheral registers to their default reset values.
 *\*\param  GPIOx :
 *\*\          - GPIOA
 *\*\          - GPIOB
 *\*\          - GPIOF
 *\*\param  Pin :
 *\*\          - GPIO_PIN_0
 *\*\          - GPIO_PIN_1
 *\*\          - GPIO_PIN_2
 *\*\          - GPIO_PIN_3
 *\*\          - GPIO_PIN_4
 *\*\          - GPIO_PIN_5
 *\*\          - GPIO_PIN_6
 *\*\          - GPIO_PIN_7
 *\*\          - GPIO_PIN_8
 *\*\          - GPIO_PIN_9
 *\*\          - GPIO_PIN_10
 *\*\          - GPIO_PIN_11
 *\*\          - GPIO_PIN_12
 *\*\          - GPIO_PIN_13
 *\*\          - GPIO_PIN_14
 *\*\          - GPIO_PIN_15
 *\*\          - GPIO_PIN_ALL
 *\*\return none
 *\*\note   If IO involves EXTI configuration, the corresponding EXTI line needs to be reset.
 */
void GPIO_DeInitPin(GPIO_Module* GPIOx, uint32_t Pin)
{
    uint32_t pos = 0x00U, currentpin;

    while((Pin >> pos) != 0U)
    {
        /* Get the IO position */
        currentpin = (Pin) & ((uint32_t)1U << pos);

        if(currentpin > 0U)
        {
            /*------------------------- GPIO Mode Configuration --------------------*/
            /* Configure IO Direction in Analog Mode */
            GPIOx->PMODE |= (GPIO_PMODE0 << (pos * 2U));

            /* Configure the default value IO Output Type */
            GPIOx->POTYPE &= ~(GPIO_POTYPE_POT0 << pos);

            /* Deactivate the Pull-up and Pull-down resistor for the current IO */
            GPIOx->PUPD &= ~(GPIO_PUPD0 << (pos * 2U));
            
            /* Configure the default value IO Output */
            GPIOx->POD &= ~(GPIO_POD_POD0 << pos);

             /* Configure the default Alternate Function in current IO */ 
            if((pos & (uint8_t)0x08U) > 0U)
            {
                if((GPIOx == GPIOA) && ((pos == 13U) || (pos == 14U)))
                {
                    /* Configure IO Direction in Alternate Mode */
                    GPIOx->PMODE &= ~(GPIO_PMODE0_3 << (pos * 2U));
                    GPIOx->PMODE |= (GPIO_AF_MODE << (pos * 2U));
                    if(pos==13U)
                    {
                        /* Deactivate the Pull-up and Pull-down resistor for the current IO */
                        GPIOx->PUPD |= (GPIO_PU_MODE << (pos * 2U));
                    }
                    else
                    {
                        /* Deactivate the Pull-up and Pull-down resistor for the current IO */
                        GPIOx->PUPD |= (GPIO_PD_MODE << (pos * 2U));
                    }

                    GPIOx->AFH &= ~((0x0FUL) << ((pos & 0x07U) * 4U)); 
                }
                else
                {
                    GPIOx->AFH |= ((0x0FUL) << ((pos & 0x07U) * 4U));
                } 
            }
            else
            {
                GPIOx->AFL |= ((0x0FUL) << ((pos & 0x07U) * 4U));
            }

            /* Configure the default DS in current IO */
            if((GPIOx == GPIOB) && ((Pin == GPIO_PIN_3) || (Pin == GPIO_PIN_4) || (Pin == GPIO_PIN_5)) )
            {
                if(Pin == GPIO_PIN_3)
                {
                    GPIOx->DS |= 0x108U;    //bit3,bit8
                }
                if(Pin == GPIO_PIN_4)
                {
                    GPIOx->DS |= 0x210U;    //bit4,bit9
                }
                if(Pin == GPIO_PIN_5)
                {
                    GPIOx->DS |= 0x420U;    //bit5,bit10
                }
            
