2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_gpio.c
    temp_value = AFIO->CFG;
    
    temp_value &= ~AFIO_CFG_IOFILTCFG;

    AFIO->CFG = (temp_value | Flit_Num);
}



/**
 *\*\name   AFIO_DIGEFTEnable.
 *\*\fun    Enables or disable digital EFT of port pins.
 *\*\param  PortSource :
 *\*\          - GPIOA_PORT_SOURCE
 *\*\          - GPIOB_PORT_SOURCE
 *\*\          - GPIOF_PORT_SOURCE
 *\*\param  Pin :
 *\*\          - GPIO_PIN_0
 *\*\          - GPIO_PIN_1
 *\*\          - GPIO_PIN_2
 *\*\          - GPIO_PIN_3
 *\*\          - GPIO_PIN_4
 *\*\          - GPIO_PIN_5
 *\*\          - GPIO_PIN_6
 *\*\          - GPIO_PIN_7
 *\*\          - GPIO_PIN_8
 *\*\          - GPIO_PIN_9
 *\*\          - GPIO_PIN_10
 *\*\          - GPIO_PIN_11
 *\*\          - GPIO_PIN_12
 *\*\          - GPIO_PIN_13
 *\*\          - GPIO_PIN_14
 *\*\          - GPIO_PIN_15
 *\*\          - GPIO_PIN_ALL
 *\*\param  Cmd :
 *\*\          - ENABLE
 *\*\          - DISABLE
 *\*\return none
 */
void AFIO_DIGEFTEnable(uint8_t PortSource, uint16_t Pin, FunctionalState Cmd)
{
    if(PortSource == GPIOA_PORT_SOURCE)
    {
        if(Cmd == ENABLE)
        {
            AFIO->DIGEFT_CFG1 |= Pin;
        }
        else
        {
            AFIO->DIGEFT_CFG1 &= (~Pin);
        }
    }
    else if(PortSource == GPIOB_PORT_SOURCE)
    {
        if(Cmd == ENABLE)
        {
            AFIO->DIGEFT_CFG2 |= Pin;
        }
        else
        {
            AFIO->DIGEFT_CFG2 &= (~Pin);
        }
    }
    else if(PortSource == GPIOF_PORT_SOURCE)
    {
        if(Cmd == ENABLE)
        {
            AFIO->DIGEFT_CFG3 |= Pin;
        }
        else
        {
            AFIO->DIGEFT_CFG3 &= (~Pin);
        }
    }
    else
    {
        /* nothing */
    }
}

/**
 *\*\name   GPIOB_Driver_Set.
 *\*\fun    GPIOB driver configuration.
 *\*\param  current 
 *\*\          - GPIOB_HIGH_DREIVE
 *\*\          - GPIOB_LOW_DREIVE
 *\*\param  GPIO_Pin
 *\*\          - GPIO_PIN_3
 *\*\          - GPIO_PIN_4
 *\*\          - GPIO_PIN_5 
 *\*\return none
 */ 
void GPIOB_Driver_Set(uint32_t current, uint32_t GPIO_Pin)
{
    uint32_t temp_value;
    temp_value = GPIOB->DS;
    temp_value &= (~GPIO_Pin);
    if(current == GPIOB_LOW_DREIVE)
    {
        temp_value |= GPIO_Pin;
    }
    else
    {
        /* no process */
    }
    GPIOB->DS = temp_value;
}

/**
 *\*\name   GPIOB_SlewRate_Set.
 *\*\fun    GPIOB slew rate configuration.
 *\*\param  slew_rate
 *\*\          - GPIOB_SLEW_RATE_FAST
 *\*\          - GPIOB_SLEW_RATE_SLOW
 *\*\param  GPIO_Pin
 *\*\          - GPIO_PIN_3
 *\*\          - GPIO_PIN_4
 *\*\          - GPIO_PIN_5 
 *\*\return none
 */
void GPIOB_SlewRate_Set(uint32_t slew_rate, uint32_t GPIO_Pin)
{
    uint32_t temp_value;
    temp_value = GPIOB->DS;
    temp_value &= (~(GPIO_Pin << REG_BIT5_OFFSET));
    if(slew_rate == GPIOB_SLEW_RATE_SLOW)
    {
        temp_value |= (GPIO_Pin << REG_BIT5_OFFSET);
    }
    else
    {
        /* no process */
    }
    GPIOB->DS = temp_value;
}

